# LoadIsConstrainedOnHost Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..LoadIsConstrainedOnHost Property
ParameterTypeId Class See Also
---
"Is constrained on host"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId LoadIsConstrainedOnHost { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property LoadIsConstrainedOnHost As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ LoadIsConstrainedOnHost {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace